app/views/students/_form.html.erb

  <%= f.label "Assign to teacher:" %><br>
  <%= f.select :teacher_id, options_for_select(Teacher.classes), include_blank: true %>
---
SELECT "teachers".* FROM "teachers"