app/views/teachers/index.html.erb

SELECT "students".* FROM "students"
---
  <tbody>
      <% Student.get_all_children_for_teacher_id( session[:teacher_id] ).each do |student| %>

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
---

<%= link_to 'Change your password', edit_teacher_path(Teacher.find_by(id: session[:teacher_id] )) %>