app/controllers/login_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = ? LIMIT 1  [["email", "Mason@mason.com"]]
---
  def login
    if request.post?
      if params[:type] == "Teacher"
        teacher = Teacher.find_by_email(params[:email])