app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
    @achievements = Achievement.all
---
SELECT "teachers".* FROM "teachers"
SELECT "achievements".* FROM "achievements"